Revit 2026 API

# ElementGetExternalResourceReference Method

---

Gets the ExternalResourceReference associated with a specified external resource type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExternalResourceReference GetExternalResourceReference(
	ExternalResourceType resourceType
)
```
```vb
Public Function GetExternalResourceReference (
	resourceType As ExternalResourceType
) As ExternalResourceReference
```
```cpp
public:
ExternalResourceReference^ GetExternalResourceReference(
	ExternalResourceType^ resourceType
)
```
```fsharp
member GetExternalResourceReference :
        resourceType : ExternalResourceType -> ExternalResourceReference
```

#### Parameters

resourceType ExternalResourceType
     The desired external resource type.

#### Return Value

ExternalResourceReference The copy of the ExternalResourceReference associated with a specified external resource type.

| Exception | Condition |
| --- | --- |
| ArgumentException | This Element does not use a resource reference for the specified resource type. |
| ArgumentNullException | A non-optional argument was null |

For an element which has multiple external resource references under a specified type like AppearanceAssetElement, it will return the first one. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReferenceExpanded].

#### Reference

Element Class

Autodesk.Revit.DB Namespace